tap "amiaopensource/amiaos", trusted: true
tap "anomalyco/tap", trusted: true
tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "borkdude/brew", trusted: true
tap "clojure-lsp/brew", trusted: true
tap "dotenvx/brew", trusted: true
tap "f1bonacc1/tap", trusted: true
tap "go-task/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "homebrew-ffmpeg/ffmpeg", trusted: true
tap "jandedobbeleer/oh-my-posh", trusted: true
tap "koekeishiya/formulae"
tap "teamookla/speedtest", trusted: true
# General-purpose data compression with high compression ratio
brew "xz"
# GNU Binutils for aarch64-elf cross development
brew "aarch64-elf-binutils"
# Ammonite is a cleanroom re-implementation of the Scala REPL
brew "ammonite-repl"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Code searching, linting, rewriting
brew "ast-grep"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text processing scripting language
brew "awk"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Parser generator
brew "bison"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# YAML Parser
brew "libyaml"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cross-platform make
brew "cmake"
# DNS server that chains plugins
brew "coredns"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Friendlier find
brew "ffind"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Generic library support script
brew "libtool"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GNOME Docking Library provides docking features for GTK+ 3
brew "gdl"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Live reload for Go apps
brew "go-air"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Post-modern modal text editor
brew "helix"
# Process manager for Procfile-based applications
brew "hivemind"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@75"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Build tool for Clojure
brew "leiningen"
# VP8/VP9 video codec
brew "libvpx"
# Next-gen compiler infrastructure
brew "llvm"
# Text-based web browser
brew "lynx"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Utility for directing compilation
brew "make"
# Language Server Protocol for Markdown
brew "marksman"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Robust (fully ACID) transactional property graph database
brew "neo4j", link: false
# Neo4j official Model Context Protocol server for AI tools
brew "neo4j-mcp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Libraries for security-enabled client and server applications
brew "nss"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Open Advanced Professional Video Codec
brew "openapv"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PNG image optimizing utility
brew "pngquant"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@17"
# Theme for zsh
brew "powerlevel10k"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Generate passwords using SecurityFoundation framework
brew "sf-pwgen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Soak up standard input and write to a file
brew "sponge"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Anonymizing overlay network for TCP
brew "tor"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Maintained ctags implementation
brew "universal-ctags"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your favorite rust -> wasm workflow tool!
brew "wasm-pack"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Bash completion for Wpcli
brew "wp-cli-completion"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Seamless ssh-agent for YubiKeys and other PIV tokens
brew "yubikey-agent"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Blackmagic Design Decklink Software Development Kit libraries
brew "amiaopensource/amiaos/decklinksdk"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# A minimal and opinionated linter for Clojure code that sparks joy.
brew "borkdude/brew/clj-kondo"
# Language Server (LSP) for Clojure
brew "clojure-lsp/brew/clojure-lsp-native"
# Secure dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
brew "f1bonacc1/tap/process-compose"
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac", "with-ggml", "with-jpeg-xl", "with-libbluray", "with-libdvdnav", "with-libdvdread", "with-librsvg", "with-libssh", "with-libtensorflow", "with-libxml2", "with-openh264", "with-openjpeg", "with-openssl", "with-openssl@3", "with-rtmpdump", "with-rubberband", "with-srt", "with-tensorflow", "with-tesseract", "with-two-lame", "with-webp", "with-whisper-cpp", "with-xvid", "with-zimg"]
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"], trusted: true
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# Menu bar icon organiser
cask "bartender"
# Web debugging Proxy application
cask "charles"
# Disk space visualiser
cask "daisydisk"
# Utility to enhance the Open and Save dialogs in applications
cask "default-folder-x"
# Collect, organise, edit and annotate documents
cask "devonthink"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Screenshot and screen recorder
cask "droplr"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Change the behavior of the fn keys depending on the active application
cask "fluor"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Tool to measure the computer system's performance
cask "geekbench"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@dev"
# Development environment
cask "hashicorp/tap/hashicorp-vagrant"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# GPU-based terminal emulator
cask "kitty"
# Create, manage and debug system and user services
cask "launchcontrol"
# Software for Logitech devices
cask "logi-options+"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Multi-platform web browser
cask "microsoft-edge"
# Multi-platform web browser
cask "microsoft-edge@dev"
# Utility that automatically downloads firmwares and installers
cask "mist"
# Tool to create text-based art
cask "monodraw"
# VPN client
cask "mullvad-vpn"
# Developer IDE or Management Environment for Neo4j instances
cask "neo4j-desktop"
# Visualiser for neural network, deep learning, and machine learning models
cask "netron"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# AI coding agent desktop client
cask "opencode-desktop"
# Workflow application to improve productivity
cask "pastebot"
# Browser for ambitious developers
cask "polypane"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Screen recording and video editing software
cask "screenflow"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Inserts pre-made snippets of text anywhere
cask "textexpander"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# AI image upscaler
cask "upscayl"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Tools for measuring, inspecting & testing on-screen graphics and layouts
cask "xscope"
# Full-featured companion app to the YubiKey
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Visual communication platform
cask "zight"
# Video communication and virtual meeting platform
cask "zoom"
vscode "4ops.packer"
vscode "abbycin.vscode-onelight2"
vscode "agavram.github-vscode-theme-minimal"
vscode "agutierrezr.emmet-keybindings"
vscode "ahmadalli.vscode-nginx-conf"
vscode "airyshift.spaces-inside-braces"
vscode "akamud.vscode-theme-onelight"
vscode "albert.tabout"
vscode "alefragnani.project-manager"
vscode "aliariff.auto-add-brackets"
vscode "amodio.find-related"
vscode "andenetalexander.vim-cheatsheet"
vscode "anoff.theme-monokai-light"
vscode "anseki.vscode-color"
vscode "anthonyjgatlin.vscode-cypher-query-language-tools"
vscode "anthropic.claude-code"
vscode "aprilandjan.ascii-tree-generator"
vscode "arcanis.vscode-zipfs"
vscode "ardenivanov.svelte-intellisense"
vscode "arr.marksman"
vscode "artlaman.chalice-icon-theme"
vscode "auracle.coffee-at-2-am"
vscode "avetis.nord-palette"
vscode "avetis.tokyo-night"
vscode "avidworks.arctis"
vscode "beardedbear.beardedicons"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "biati.vscode-text-tools"
vscode "bierner.color-info"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-shiki"
vscode "biomejs.biome"
vscode "bmalehorn.vscode-fish"
vscode "bmewburn.vscode-intelephense-client"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "bubersson.theme-hop-light"
vscode "buenon.scratchpads"
vscode "butov-dev.new-ui-dark-theme"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "castwide.solargraph"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "chdsbd.githubinator"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chukwuamaka.csvtojson-converter"
vscode "circledev.glsl-canvas"
vscode "cleanthemes.matte-black-theme"
vscode "codezombiech.gitignore"
vscode "conradludgate.rust-playground"
vscode "cs50.vscode-presentation-mode"
vscode "ctf0.auto-comment-next-line"
vscode "ctf0.smart-delete"
vscode "danlevett.pattern-links"
vscode "davidanson.vscode-markdownlint"
vscode "davidnussio.vscode-jq-playground"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "deerawan.vscode-faker"
vscode "docker.docker"
vscode "donjayamanne.typescript-notebook"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "drrouman.git-coauthors"
vscode "dsrkafuu.vscode-theme-aofuji"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-highlight"
vscode "fabiospampinato.vscode-markdown-todo"
vscode "fabiospampinato.vscode-projects-plus"
vscode "fabiospampinato.vscode-todo-plus"
vscode "fayras.simple-new-file"
vscode "felipe-mendes.slack-theme"
vscode "fem12n.night"
vscode "file-icons.file-icons"
vscode "folke.vscode-monorepo-workspace"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "gabrielbatista.davinci"
vscode "gdesnoues.complete-line"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.hcl"
vscode "hbenl.vscode-test-explorer"
vscode "hermitter.oh-lucy-vscode"
vscode "hideoo.create"
vscode "hilleer.yaml-plus-json"
vscode "hoaian.simple-flat-theme"
vscode "huacat.office-theme"
vscode "ibm.output-colorizer"
vscode "includable.file-duplicate"
vscode "itslooklike.markdown-svelte"
vscode "jakearl.search-editor-apply-changes"
vscode "jakebecker.elixir-ls"
vscode "james-yu.latex-workshop"
vscode "jannisx11.batch-rename-extension"
vscode "jasonlhy.hungry-delete"
vscode "jasonnutter.search-node-modules"
vscode "jloow.vscode-criticmarkup"
vscode "jmkrivocapich.drawfolderstructure"
vscode "jobe451.lorem-whatever"
vscode "jpdrbrc.multifile"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "jscearcy.rust-doc-viewer"
vscode "kahole.magit"
vscode "kaiwood.endwise"
vscode "kareemosama.codesnap-ko"
vscode "kevinrose.vsc-python-indent"
vscode "kirozen.wordcounter"
vscode "kogai.regex-railroad-diagrams"
vscode "koichisasada.vscode-rdbg"
vscode "kricsleo.vscode-package-json-inspector"
vscode "kuba-p.theme-pink-candy"
vscode "labocho.chmod-command"
vscode "laziu.dejavu-vscode-theme"
vscode "leighlondon.eml"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "loilo.snazzy-light"
vscode "lostintangent.vsls-pomodoro"
vscode "lostintangent.vsls-whiteboard"
vscode "magicstack.magicpython"
vscode "matteobigoi.bacon-ls-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "metaseed.metaword"
vscode "mgesbert.python-path"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "monosans.djlint"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-containers"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-copilot-vision"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "neo-ltex.ltex"
vscode "neo4j-extensions.neo4j-for-vscode"
vscode "ohmnivore.twospacefourspace"
vscode "openai.chatgpt"
vscode "pabue.cotion-theme"
vscode "panicbit.cargo"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "paulshen.css-in-js-fold"
vscode "pflannery.vscode-versionlens"
vscode "philippark.dark-filk"
vscode "philsinatra.nested-comments"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "raczzalan.webgl-glsl-editor"
vscode "rdfox.rdfox-rdf"
vscode "recoil-snippets-with-ts.recoiljs-snippets-with-ts"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "riipandi.vscode-atomizer-theme"
vscode "ronnidc.nunjucks"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "saeed-nazari.adonis-theme"
vscode "sakethkanchi.kitty-vscode-theme"
vscode "samadamday.markdown-clever-lists"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "searking.preview-vscode"
vscode "seatonjiang.gitmoji-vscode"
vscode "sebsojeda.vscode-apple-music"
vscode "shader-ls.vscode-shader"
vscode "shaneliesegang.vscode-simple-icons-rev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "shyykoserhiy.git-autoconfig"
vscode "silasmarvin.lsp-ai"
vscode "sissel.json-script-tag"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.shader"
vscode "snazzytheme.snazzy-vscode"
vscode "statelyai.stately-vscode"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "swellaby.vscode-rust-test-adapter"
vscode "sysoev.language-stylus"
vscode "sztheory.vscode-packer-powertools"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tecosaur.latex-utilities"
vscode "tentalabs.arctica"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "thierrymichel.vscode-gitmoji-snippets"
vscode "timomeh.git-notch"
vscode "timonwong.shellcheck"
vscode "tjk.nebula-vscode"
vscode "tldraw-org.tldraw-vscode"
vscode "tusaeff.vscode-iterm2-theme-sync"
vscode "typescriptteam.native-preview"
vscode "tyriar.sort-lines"
vscode "uloco.theme-bluloco-light"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "usernamehw.indent-one-space"
vscode "usernamehw.remove-empty-lines"
vscode "vadimcn.vscode-lldb"
vscode "viablelab.bracket-padder"
vscode "viablelab.capitalize"
vscode "vincaslt.highlight-matching-tag"
vscode "vintharas.learn-vim"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscode-org-mode.org-mode"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "wallabyjs.dingo-vscode"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wholroyd.jinja"
vscode "william-voyek.vscode-nginx"
vscode "wraith13.bracket-lens"
vscode "yahyabatulu.vscode-markdown-alert"
vscode "yinfei.luahelper"
vscode "ymotongpoo.licenser"
vscode "yomitosh.livegrep"
vscode "yummygum.city-lights-icon-vsc"
vscode "yzhang.markdown-all-in-one"
vscode "zfzackfrost.commentbars"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "bacon"
cargo "bacon-ls"
cargo "cargo-watch"
cargo "evcxr_jupyter"
cargo "lsp-ai"
cargo "wasm-pack"
npm "corepack"
npm "openclaw"
